<?php
/*
  ****************************************************************************
  ***                                                                      ***
  ***      Viart Shop 5.8                                                  ***
  ***      File:  install_messages.php                                     ***
  ***      Built: Fri Nov  6 06:13:11 2020                                 ***
  ***      http://www.viart.com                                            ***
  ***                                                                      ***
  ****************************************************************************
*/

$messages = array(
	//съобщения свързани с инсталацията
	"INSTALL_TITLE" => "Инсталация на ViArt магазин",

	"INSTALL_STEP_1_TITLE" => "Инсталация: Стъпка 1",
	"INSTALL_STEP_1_DESC" => "Благодарим ви, че избрахте ViArt магазина. За да продължите с инсталацията, моля попълнете поисканите по-долу детайли. Обърнете внимание, че избраната от вас база данни вече трябва да съществува. Ако инсталирате база данни, която използва ODBC, като MS Access, трябва първо да създадете DSN за нея, преди да продължите.",
	"INSTALL_STEP_2_TITLE" => "Инсталация: Стъпка 2",
	"INSTALL_STEP_2_DESC" => "",
	"DESIGN_SELECTION_MSG" => "Design Selection",
	"INSTALL_STEP_3_TITLE" => "Инсталация: Стъпка 3",
	"INSTALL_STEP_3_DESC" => "Моля изберете изгледа на сайта. Ще можете да промените изгледа и след това.",
	"INSTALL_FINAL_TITLE" => "Инсталация: Окончателна",
	"SELECT_DATE_TITLE" => "Изберете формат на датата.",
	"GET_SUPPORT_MSG" => "Get Support",
	"INSTALLATION_HELP_MSG" => "Installation Help",

	"DB_SETTINGS_MSG" => "Настройки на базата данни.",
	"DB_PROGRESS_MSG" => "Процес на запълване структурата на базата данни.",
	"SELECT_PHP_LIB_MSG" => "Избор на PHP библиотека.",
	"SELECT_DB_TYPE_MSG" => "Избор на тип база данни.",
	"ADMIN_SETTINGS_MSG" => "Административни настройки.",
	"DATE_SETTINGS_MSG" => "Формати на датата.",
	"NO_DATE_FORMATS_MSG" => "Няма налични формати на датата.",
	"INSTALL_FINISHED_MSG" => "В този момент вашата първоначална инсталация е завършена. Моля проверете всички настройки в частта за администрация и направете всички нужни промени.",
	"ACCESS_ADMIN_MSG" => "За да влезете в частта за администрация натиснете тук.",
	"ADMIN_URL_MSG" => "Адрес за администрация",
	"MANUAL_URL_MSG" => "Адрес за наръчник",
	"THANKS_MSG" => "Благодарим ви, че избрахте <b>ViArt SHOP</b>.",

	"DB_TYPE_FIELD" => "Тип база данни",
	"DB_TYPE_DESC" => "Моля изберете <b>типа на базата данни</b> която използвате. Ако използвате SQL Server или Microsoft Access, моля изберете ODBC.",
	"DB_PHP_LIB_FIELD" => "PHP библиотека",
	"DB_HOST_FIELD" => "Име на хоста",
	"DB_HOST_DESC" => "Моля въведете <b>име</b> или <b>IP адрес на сървъра</b> на който вашата ViArt база данни ще работи. Ако използвате вашата база данни на вашият компютър, тогава само може да оставите това като \"<b>localhost</b>\" , а порта празен. Ако използвате база данни предоставена ви от хост компанията ви, моля погледнете документите на вашата хост компания, за настройките на сървъра.",
	"DB_PORT_FIELD" => "Порт",
	"DB_NAME_FIELD" => "Име на база данни / DSN",
	"DB_NAME_DESC" => "Ако използвате база данни като MySQL или PostgreSQL тогава моля въведете <b>името на базата данни</b> където бихте искали вашия ViArt да създаде таблиците си. Тази база данни трябва вече да съществува. Ако просто инсталирате ViArt за тестови цели на вашия локален компютър тогава повечето системи имат \"<b>тестова</b>\" база данни, която можете да използвате. Ако не, моля създайте база данни като \"viart\" и използвайте нея. Ако използвате Microsoft Access или SQL Server тогава Име на базата данни трябва да бъде <b>име на DSN</b> която сте настроили в Data Sources (ODBC) частта във вашия Control Panel.",
	"DB_USER_FIELD" => "Потребителско име",
	"DB_PASS_FIELD" => "Парола",
	"DB_USER_PASS_DESC" => "<b>Потребителско име</b> и <b>Парола</b> - моля въведете потребителско име и парола, с които искате да достъпвате базата данни. Ако използвате локална тестова инсталация потребителското име вероятно е \"<b>root</b>\" и паролата вероятно не е попълнена. Това не е проблем в тестов режим но имайте предвид, че не е безопасно в реален режим.",
	"DB_PERSISTENT_FIELD" => "Постоянна връзка",
	"DB_PERSISTENT_DESC" => "За да използвате MySQL или Postgre постоянни връзки, отметнете тази кутийка. Ако не знаете какво означава това, по добре не я отмятайте.",
	"DB_CREATE_DB_FIELD" => "Създаване база данни",
	"DB_CREATE_DB_DESC" => "За създаване на база данни, ако е възможно, отбележете тук. Работи само за MySQL и Postgre.",
	"DB_POPULATE_FIELD" => "Запълване на база данни",
	"DB_POPULATE_DESC" => "За да създадете структурната таблица на базата данни и я запълните с данни и отметнете кутийката.",
	"DB_TEST_DATA_FIELD" => "Тестови данни",
	"DB_TEST_DATA_DESC" => "За да добавите някакви тестови данни в базата данни, отбележете тази кутийка.",
	"ADMIN_EMAIL_FIELD" => "E-mail на администратора",
	"ADMIN_LOGIN_FIELD" => "Потребителско име на администратора",
	"ADMIN_PASS_FIELD" => "Парола на администратора",
	"ADMIN_CONF_FIELD" => "Повторете парола",
	"DATETIME_SHOWN_FIELD" => "Формат на датата и часа (показван на страницата).",
	"DATE_SHOWN_FIELD" => "Формат на датата (показван на страницата).",
	"DATETIME_EDIT_FIELD" => "Формат на датата и часа (за редакция).",
	"DATE_EDIT_FIELD" => "Формат на датата (за редакция).",
	"DATE_FORMAT_COLUMN" => "Формат на датата",

	"DB_LIBRARY_ERROR" => "PHP функциите за {db_library} не са дефинирани. Моля проверете настройките на базата данни в конфигурационния файл - php.ini.",
	"DB_CONNECT_ERROR" => "Няма връзка с базата данни. Моля проверете параметрите на базата данни.",
	"INSTALL_FINISHED_ERROR" => "Процеса на инсталацията приключи.",
	"WRITE_FILE_ERROR" => "Нямате права за писане във файла <b>'includes/var_definition.php'</b>. Моля променете правата за файла преди да продължите.",
	"WRITE_DIR_ERROR" => "Нямате права за писане в папката <b>'includes/'</b>. Моля променете правата за папката преди да продължите.",
	"DUMP_FILE_ERROR" => "Dump файла '{file_name}' не е намерен.",
	"DB_TABLE_ERROR" => "Таблицата '{table_name}' не беше намерена. Моля запълнете базата данни с необходимите данни.",
	"TEST_DATA_ERROR" => "Отметнете <b>{POPULATE_DB_FIELD}</b> преди запълването на таблиците с данни за теста.",
	"DB_HOST_ERROR" => "Името на хоста, който сте въвели не е намерено.",
	"DB_PORT_ERROR" => "Няма връзка със сървъра за базата данни на посочения порт.",
	"DB_USER_PASS_ERROR" => "Потребителското име или паролата не са правилни.",
	"DB_NAME_ERROR" => "Настройките за включване са правилни, но базата данни '{db_name}' не може да бъде намерена.",

	//съобщения свързани с обновяването
	"UPGRADE_TITLE" => "Осъвременяване на ViArt магазина.",
	"UPGRADE_NOTE" => "Забележка: Моля направете резервно копие на базата данни преди да продължите.",
	"UPGRADE_AVAILABLE_MSG" => "Обновяването на базата данни е възможно.",
	"UPGRADE_BUTTON" => "Надграждане на базата данни до {version_number} сега.",
	"CURRENT_VERSION_MSG" => "Текуща версия",
	"LATEST_VERSION_MSG" => "Версия налична за инсталация.",
	"UPGRADE_RESULTS_MSG" => "Резултати от надграждането.",
	"SQL_SUCCESS_MSG" => "SQL прехвърляне успешно.",
	"SQL_FAILED_MSG" => "SQL прехвърляне неуспешно.",
	"SQL_TOTAL_MSG" => "Общо SQL прехвърляния са извършени.",
	"VERSION_UPGRADED_MSG" => "Вашата база данни бе надградена до",
	"ALREADY_LATEST_MSG" => "Вие вече имате последната версия.",
	"DOWNLOAD_NEW_MSG" => "Открита е нова версия.",
	"DOWNLOAD_NOW_MSG" => "Свалете версията {version_number} сега.",
	"DOWNLOAD_FOUND_MSG" => "Открихме, че нова {version_number} версия е налична за сваляне. Моля натиснете на връзката долу за да започне свалянето. След като изтеглянето приключи и замените файловете не забравяйте да включите отново рутинното обновяване. ",
	"NO_XML_CONNECTION" => "Внимание! Няма връзка с 'http://www.viart.com/' !",

	"END_USER_LICENSE_AGREEMENT_MSG" => "End User License Agreement",
	"AGREE_LICENSE_AGREEMENT_MSG" => "I have read and agree to the License Agreement",
	"READ_LICENSE_AGREEMENT_MSG" => "Click here to read license agreement",
	"LICENSE_AGREEMENT_ERROR" => "Please read and agree to the License Agreement before proceeding.",

);
$va_messages = array_merge($va_messages, $messages);
