<?php
/*
  ****************************************************************************
  ***                                                                      ***
  ***      Viart Shop 5.6                                                  ***
  ***      File:  install_messages.php                                     ***
  ***      Built: Wed Feb 12 01:09:03 2020                                 ***
  ***      http://www.viart.com                                            ***
  ***                                                                      ***
  ****************************************************************************
*/

$messages = array(
	// installation messages
	"INSTALL_TITLE" => "نصب فروشگاه ساز ViArt",

	"INSTALL_STEP_1_TITLE" => "نصب: گام 1",
	"INSTALL_STEP_1_DESC" => "از انتخاب فروشگاه ساز ViArt متشکریم. به منظور ادامه نصب، لطفا جزئیات درخواست شده زیر را پر کنید. لطفا توجه کنید پایگاه داده را که انتخاب می نمایید بایستی موجود باشد. اگر شما با استفاده از یک پایگاه داده ODBC نصب می کنید، مثلا : MS Access ابتدا باید یک DSN قبل از اقدام برای آن ایجاد کنید.",
	"INSTALL_STEP_2_TITLE" => "نصب: گام 2",
	"INSTALL_STEP_2_DESC" => "",
	"DESIGN_SELECTION_MSG" => "Design Selection",
	"INSTALL_STEP_3_TITLE" => "نصب: گام 3",
	"INSTALL_STEP_3_DESC" => "لطفا طرح سایت را انتخاب کنید. شما پس از این می توانید طرح را تغییر دهید.",
	"INSTALL_FINAL_TITLE" => "نصب: پایان",
	"SELECT_DATE_TITLE" => "انتخاب قالب تاریخ",
	"GET_SUPPORT_MSG" => "Get Support",
	"INSTALLATION_HELP_MSG" => "Installation Help",

	"DB_SETTINGS_MSG" => "تنظیمات پایگاه داده",
	"DB_PROGRESS_MSG" => "فرایند ورود ساختار پایگاه داده",
	"SELECT_PHP_LIB_MSG" => "انتخاب کتابخانه PHP",
	"SELECT_DB_TYPE_MSG" => "انتخاب نوع پایگاه داده",
	"ADMIN_SETTINGS_MSG" => "تنظیمات مدیریت",
	"DATE_SETTINGS_MSG" => "قالب تاریخ",
	"NO_DATE_FORMATS_MSG" => "عدم دسترسی قالب تاریخ",
	"INSTALL_FINISHED_MSG" => "در این مرحله اساس نصب کاملا انجام شد. لطفا تنظیمات در بخش مدیریت را بررسی کنید و تغییرات لازم را اعمال کنید.",
	"ACCESS_ADMIN_MSG" => "برای دسترسی به بخش مدیریت اینجا کلیک کنید",
	"ADMIN_URL_MSG" => "آدرس مدیریت",
	"MANUAL_URL_MSG" => "آدرس راهنما",
	"THANKS_MSG" => "از انتخاب <b>فروشگاه ساز ViArt</b> متشکریم.",

	"DB_TYPE_FIELD" => "نوع پایگاه داده",
	"DB_TYPE_DESC" => "لطفا <b>نوع پایگاه داده ای</b> که استفاده می کنید را انتخاب نمایید. اگر با SQL Server یا Microsoft Access کار می کنید، لطفا ODBC را انتخاب کنید.",
	"DB_PHP_LIB_FIELD" => "کتابخانه PHP",
	"DB_HOST_FIELD" => "نام میزبان",
	"DB_HOST_DESC" => "لطفا نام و یا آدرس IP سرویس دهنده ای که در آن پایگاه داده ViArt را اجرا خواهید کرد وارد نمایید. اگر پایگاه داده روی رایانه محلی تان در حال اجراست آنوقت فقط با عنوان \"localhost \" و درگاه را خالی می توانید بگذارید. اگر شما از یک پایگاه داده ارائه شده توسط شرکت میزبان فضا استفاده می کنید، لطفا مستندات شرکت میزبان خود را برای تنظیمات سرور مشاهده نمایید.",
	"DB_PORT_FIELD" => "درگاه",
	"DB_NAME_FIELD" => "نام پایگاه داده / DSN",
	"DB_NAME_DESC" => "اگر از پایگاه داده ای همانند MySQL یا PostgreSQL استفاده می کنید لطفا <b>نام پایگاه داده ای</b> را که می خواهید ViArt جداول را در آنجا ایجاد نماید وارد کنید. پایگاه داده بایستی موجود باشد. اگر هدف شما از نصب ViArt جهت آزمایش روی رایانه محلی می باشد آنگاه می توانید یک پایگاه داده \"<b>test</b>\" داشته باشید. وگرنه یک پایگاه داده مانند \"viart\" ایجاد و از آن استفاده کنید. اگر از Microsoft Access یا SQL Server استفاده می کنید آنگاه <b>نام پایگاه داده</b> بایستی نام DSN را در منبع داده (ODBC) بخشی از کنترل پنل تنظیم نمایید.",
	"DB_USER_FIELD" => "نام کاربري",
	"DB_PASS_FIELD" => "گذرواژه",
	"DB_USER_PASS_DESC" => "<b>نام کاربری</b> و <b>گذرواژه</b> - لطفا نام کاربری و گذرواژه را برای دسترسی و استفاده پایگاه داده وارد نمایید. اگر شما در حال نصب آزمایشی محلی (Local) هستید احتمالا نام کاربری  \"<b>root</b>\" و گذرواژه خالی بوده و برای آزمایش مناسب است، اما لطفا توجه کنید این روی سرور ایمن نیست.",
	"DB_PERSISTENT_FIELD" => "ارتباط مداوم",
	"DB_PERSISTENT_DESC" => "برای ارتباط مداوم با MySQL یا Postgre ، این جعبه را علامت بزنید. اگر چیزی از مفهوم آن نمی دانید، پس شاید بهتره آنرا بدون علامت بگذارید",
	"DB_CREATE_DB_FIELD" => "ایجاد پایگاه داده",
	"DB_CREATE_DB_DESC" => "در صورت امکان برای ایجاد پایگاه داده، این جعبه را علامت بزنید. تنها برای MySQL و Postgre کار می کند",
	"DB_POPULATE_FIELD" => "ورود پایگاه داده",
	"DB_POPULATE_DESC" => "برای ایجاد جداول ساختاری پایگاه داده و ورود داده آن جعبه را علامت بزنید",
	"DB_TEST_DATA_FIELD" => "داده آزمایشی",
	"DB_TEST_DATA_DESC" => "برای افزودن اطلاعات آزمایشی به پایگاه داده شما جعبه را تیک بزنید",
	"ADMIN_EMAIL_FIELD" => "ايميل مدير",
	"ADMIN_LOGIN_FIELD" => "ورود به مديريت",
	"ADMIN_PASS_FIELD" => "مديريت رمزعبور",
	"ADMIN_CONF_FIELD" => "تاييد رمزعبور",
	"DATETIME_SHOWN_FIELD" => "قالب زمان (نمایش یافته روی سایت)",
	"DATE_SHOWN_FIELD" => "فرم تاریخ (نمایش یافته روی سایت)",
	"DATETIME_EDIT_FIELD" => "قالب تاریخ-زمان (برای ویرایش)",
	"DATE_EDIT_FIELD" => "قالب تاریخ (جهت ویرایش)",
	"DATE_FORMAT_COLUMN" => "قالب تاریخ",

	"DB_LIBRARY_ERROR" => "توابع PHP برای {db_library} تعریف نشده است. لطفا تنظیمات پایگاه داده را در فایل پیکربندی - php.ini بررسی کنید.",
	"DB_CONNECT_ERROR" => "به پایگاه داده نمی تواند متصل شود. لطفا پارامترهای پایگاه داده را بررسی کنید.",
	"INSTALL_FINISHED_ERROR" => "روند نصب و راه اندازی در حال حاضر به پایان رسید.",
	"WRITE_FILE_ERROR" => "اجازه دسترسی جهت نوشتن روی فایل <b>'includes/var_definition.php'</b> ندارد. لطفا قبل از ادامه دادن اجازه دسترسی فایل را تغییر دهید.",
	"WRITE_DIR_ERROR" => "فولدر <b>'includes/'</b> اجازه دسترسی جهت نوشتن ندارد. لطفا قبل از ادامه دادن دسترسی فولدر را تغییر دهید.",
	"DUMP_FILE_ERROR" => "فایل '{file_name}' یافت نشد.",
	"DB_TABLE_ERROR" => "جدول '{table_name}' یافت نشد. لطفا پایگاه داده را با داده های لازم پر کنید.",
	"TEST_DATA_ERROR" => "قبل از پر شدن جداول با داده آزمایشی <b>{POPULATE_DB_FIELD}</b> بررسی شود",
	"DB_HOST_ERROR" => "نام میزبانی که مشخص کردید موجود نیست.",
	"DB_PORT_ERROR" => "با استفاده از درگاه مشخص شده نمی تواند به سرور پایگاه داده متصل شود.",
	"DB_USER_PASS_ERROR" => "نام کاربري يا کلمه عبور تايين شده شما صحيح نيست.",
	"DB_NAME_ERROR" => "تنظیمات ورودی صحیح بود، اما پایگاه داده '{db_name}' یافت نشد.",

	// upgrade messages
	"UPGRADE_TITLE" => "بروزرسانی فروشگاه ViArt",
	"UPGRADE_NOTE" => "توجه: لطفا قبل از هر اقدامی فایل پشتیبان از پایگاه داده بگیرید.",
	"UPGRADE_AVAILABLE_MSG" => "ارتقاء پایگاه داده های در دسترس",
	"UPGRADE_BUTTON" => "اکنون ارتقاء پایگاه داده به {version_number}",
	"CURRENT_VERSION_MSG" => "نسخه نصب شده حال حاضر",
	"LATEST_VERSION_MSG" => "نسخه موجود برای نصب",
	"UPGRADE_RESULTS_MSG" => "نتایج بروزرسانی",
	"SQL_SUCCESS_MSG" => "انجام موفق پرس و جوی SQL",
	"SQL_FAILED_MSG" => "پرس و جوی ناموفق SQL",
	"SQL_TOTAL_MSG" => "مجموع پرسش های SQL اجرا شده",
	"VERSION_UPGRADED_MSG" => "پایگاه داده شما ارتقاء یافت به",
	"ALREADY_LATEST_MSG" => "اکنون شما آخرین نسخه را دارید",
	"DOWNLOAD_NEW_MSG" => "نسخه جدید یافت شد",
	"DOWNLOAD_NOW_MSG" => "اکنون دریافت نسخه {version_number}",
	"DOWNLOAD_FOUND_MSG" => "نسخه جديد {version_number} براي دريافت در دسترس است. لطفا روي کليد زير براي شروع دريافت کليک کنيد. بعد از دريافت و جايگزيني کامل اجراي فايل آپگريد را فراموش نکنيد.",
	"NO_XML_CONNECTION" => "هشدار! جهت دسترسی به 'http://www.viart.com/' متصل نیست!",

	"END_USER_LICENSE_AGREEMENT_MSG" => "توافقنامه مجوز کاربری",
	"AGREE_LICENSE_AGREEMENT_MSG" => "اینجانب توافقنامه مجوز را مطالعه و می پذیرم",
	"READ_LICENSE_AGREEMENT_MSG" => "برای مطالعه توافقنامه مجوز اینجا کلیک نمایید",
	"LICENSE_AGREEMENT_ERROR" => "لطفا قبل از انجام فرایند توافقنامه مجوز را مطالعه و بپذیرید.",

);
$va_messages = array_merge($va_messages, $messages);
